hpmicro/hpm_sdk/soc/HPM6800/ip/hpm_mcan_regs.h
/* Bitfield definition for register: ILE */
/*
 * EINT1 (RW)
 *
 * Enable Interrupt Line 1
 * 0= Interrupt line m_can_int1 disabled
 * 1= Interrupt line m_can_int1 enabled
 */
#define MCAN_ILE_EINT1_MASK (0x2U)
#define MCAN_ILE_EINT1_SHIFT (1U)
#define MCAN_ILE_EINT1_SET(x) (((uint32_t)(x) << MCAN_ILE_EINT1_SHIFT) & MCAN_ILE_EINT1_MASK)
#define MCAN_ILE_EINT1_GET(x) (((uint32_t)(x) & MCAN_ILE_EINT1_MASK) >> MCAN_ILE_EINT1_SHIFT)

/*
 * EINT0 (RW)
 *
 * Enable Interrupt Line 0
 * 0= Interrupt line m_can_int0 disabled
 * 1= Interrupt line m_can_int0 enabled
 */
#define MCAN_ILE_EINT0_MASK (0x1U)
#define MCAN_ILE_EINT0_SHIFT (0U)
#define MCAN_ILE_EINT0_SET(x) (((uint32_t)(x) << MCAN_ILE_EINT0_SHIFT) & MCAN_ILE_EINT0_MASK)
#define MCAN_ILE_EINT0_GET(x) (((uint32_t)(x) & MCAN_ILE_EINT0_MASK) >> MCAN_ILE_EINT0_SHIFT)

/* Bitfield definition for register: GFC */
/*
 * ANFS (RW)
 *
 * Accept Non-matching Frames Standard
 * Defines how received messages with 11-bit IDs that do not match any element of the filter list are treated.
 * 00= Accept in Rx FIFO 0
 * 01= Accept in Rx FIFO 1
 * 10= Reject
 * 11= Reject
 */
#define MCAN_GFC_ANFS_MASK (0x30U)
#define MCAN_GFC_ANFS_SHIFT (4U)
#define MCAN_GFC_ANFS_SET(x) (((uint32_t)(x) << MCAN_GFC_ANFS_SHIFT) & MCAN_GFC_ANFS_MASK)
#define MCAN_GFC_ANFS_GET(x) (((uint32_t)(x) & MCAN_GFC_ANFS_MASK) >> MCAN_GFC_ANFS_SHIFT)

/*
 * ANFE (RW)
 *
 * Accept Non-matching Frames Extended
 * Defines how received messages with 29-bit IDs that do not match any element of the filter list are treated.
 * 00= Accept in Rx FIFO 0
 * 01= Accept in Rx FIFO 1
 * 10= Reject
 * 11= Reject
 */
#define MCAN_GFC_ANFE_MASK (0xCU)
#define MCAN_GFC_ANFE_SHIFT (2U)
#define MCAN_GFC_ANFE_SET(x) (((uint32_t)(x) << MCAN_GFC_ANFE_SHIFT) & MCAN_GFC_ANFE_MASK)
#define MCAN_GFC_ANFE_GET(x) (((uint32_t)(x) & MCAN_GFC_ANFE_MASK) >> MCAN_GFC_ANFE_SHIFT)

/*
 * RRFS (RW)
 *
 * Reject Remote Frames Standard
 * 0= Filter remote frames with 11-bit standard IDs
 * 1= Reject all remote frames with 11-bit standard IDs
 */
#define MCAN_GFC_RRFS_MASK (0x2U)
#define MCAN_GFC_RRFS_SHIFT (1U)
#define MCAN_GFC_RRFS_SET(x) (((uint32_t)(x) << MCAN_GFC_RRFS_SHIFT) & MCAN_GFC_RRFS_MASK)
#define MCAN_GFC_RRFS_GET(x) (((uint32_t)(x) & MCAN_GFC_RRFS_MASK) >> MCAN_GFC_RRFS_SHIFT)

/*
 * RRFE (RW)
 *
 * Reject Remote Frames Extended
 * 0= Filter remote frames with 29-bit extended IDs
 * 1= Reject all remote frames with 29-bit extended IDs
 */
#define MCAN_GFC_RRFE_MASK (0x1U)
#define MCAN_GFC_RRFE_SHIFT (0U)
#define MCAN_GFC_RRFE_SET(x) (((uint32_t)(x) << MCAN_GFC_RRFE_SHIFT) & MCAN_GFC_RRFE_MASK)
#define MCAN_GFC_RRFE_GET(x) (((uint32_t)(x) & MCAN_GFC_RRFE_MASK) >> MCAN_GFC_RRFE_SHIFT)

/* Bitfield definition for register: SIDFC */
/*
 * LSS (RW)
 *
 * List Size Standard
 * 0= No standard Message ID filter
 * 1-128= Number of standard Message ID filter elements
 * >128= Values greater than 128 are interpreted as 128
 */
#define MCAN_SIDFC_LSS_MASK (0xFF0000UL)
#define MCAN_SIDFC_LSS_SHIFT (16U)
#define MCAN_SIDFC_LSS_SET(x) (((uint32_t)(x) << MCAN_SIDFC_LSS_SHIFT) & MCAN_SIDFC_LSS_MASK)
#define MCAN_SIDFC_LSS_GET(x) (((uint32_t)(x) & MCAN_SIDFC_LSS_MASK) >> MCAN_SIDFC_LSS_SHIFT)

/*
 * FLSSA (RW)
 *
 * Filter List Standard Start Address
 * Start address of standard Message ID filter list (32-bit word address)
 */
#define MCAN_SIDFC_FLSSA_MASK (0xFFFCU)
#define MCAN_SIDFC_FLSSA_SHIFT (2U)
#define MCAN_SIDFC_FLSSA_SET(x) (((uint32_t)(x) << MCAN_SIDFC_FLSSA_SHIFT) & MCAN_SIDFC_FLSSA_MASK)
#define MCAN_SIDFC_FLSSA_GET(x) (((uint32_t)(x) & MCAN_SIDFC_FLSSA_MASK) >> MCAN_SIDFC_FLSSA_SHIFT)

/* Bitfield definition for register: XIDFC */
/*
 * LSE (RW)
 *
 * List Size Extended
 * 0= No extended Message ID filter
 * 1-64= Number of extended Message ID filter elements
 * >64= Values greater than 64 are interpreted as 64
 */
#define MCAN_XIDFC_LSE_MASK (0x7F0000UL)
#define MCAN_XIDFC_LSE_SHIFT (16U)
#define MCAN_XIDFC_LSE_SET(x) (((uint32_t)(x) << MCAN_XIDFC_LSE_SHIFT) & MCAN_XIDFC_LSE_MASK)
#define MCAN_XIDFC_LSE_GET(x) (((uint32_t)(x) & MCAN_XIDFC_LSE_MASK) >> MCAN_XIDFC_LSE_SHIFT)

/*
 * FLESA (RW)
 *
 * Filter List Extended Start Address
 * Start address of extended Message ID filter list (32-bit word address).
 */
#define MCAN_XIDFC_FLESA_MASK (0xFFFCU)
#define MCAN_XIDFC_FLESA_SHIFT (2U)
#define MCAN_XIDFC_FLESA_SET(x) (((uint32_t)(x) << MCAN_XIDFC_FLESA_SHIFT) & MCAN_XIDFC_FLESA_MASK)
#define MCAN_XIDFC_FLESA_GET(x) (((uint32_t)(x) & MCAN_XIDFC_FLESA_MASK) >> MCAN_XIDFC_FLESA_SHIFT)

/* Bitfield definition for register: XIDAM */
/*
 * EIDM (RW)
 *
 * Extended ID Mask
 * For acceptance filtering of extended frames the Extended ID AND Mask is ANDed with the Message ID of a received frame.
 *  Intended for masking of 29-bit IDs in SAE J1939. With the reset value of all bits set to one the mask is not active.
 */
#define MCAN_XIDAM_EIDM_MASK (0x1FFFFFFFUL)
#define MCAN_XIDAM_EIDM_SHIFT (0U)
#define MCAN_XIDAM_EIDM_SET(x) (((uint32_t)(x) << MCAN_XIDAM_EIDM_SHIFT) & MCAN_XIDAM_EIDM_MASK)
#define MCAN_XIDAM_EIDM_GET(x) (((uint32_t)(x) & MCAN_XIDAM_EIDM_MASK) >> MCAN_XIDAM_EIDM_SHIFT)

/* Bitfield definition for register: HPMS */
/*
 * FLST (R)
 *
 * Filter List
 * Indicates the filter list of the matching filter element.
 * 0= Standard Filter List
 * 1= Extended Filter List
 */
#define MCAN_HPMS_FLST_MASK (0x8000U)
#define MCAN_HPMS_FLST_SHIFT (15U)
#define MCAN_HPMS_FLST_GET(x) (((uint32_t)(x) & MCAN_HPMS_FLST_MASK) >> MCAN_HPMS_FLST_SHIFT)

/*
 * FIDX (R)
 *
 * Filter Index
 * Index of matching filter element. Range is 0 to SIDFC.LSS - 1 resp. XIDFC.LSE - 1.
 */
#define MCAN_HPMS_FIDX_MASK (0x7F00U)
#define MCAN_HPMS_FIDX_SHIFT (8U)
#define MCAN_HPMS_FIDX_GET(x) (((uint32_t)(x) & MCAN_HPMS_FIDX_MASK) >> MCAN_HPMS_FIDX_SHIFT)

/*
 * MSI (R)
 *
 * Message Storage Indicator
 * 00= No FIFO selected
 * 01= FIFO message lost
 * 10= Message stored in FIFO 0
 * 11= Message stored in FIFO 1
 */
#define MCAN_HPMS_MSI_MASK (0xC0U)
#define MCAN_HPMS_MSI_SHIFT (6U)
#define MCAN_HPMS_MSI_GET(x) (((uint32_t)(x) & MCAN_HPMS_MSI_MASK) >> MCAN_HPMS_MSI_SHIFT)

