hpmicro/hpm_sdk/soc/HPM6800/ip/hpm_mcan_regs.h
/*
 * F1WM (RW)
 *
 * Rx FIFO 1 Watermark
 * 0= Watermark interrupt disabled
 * 1-64= Level for Rx FIFO 1 watermark interrupt (IR.RF1W)
 * >64= Watermark interrupt disabled
 */
#define MCAN_RXF1C_F1WM_MASK (0x7F000000UL)
#define MCAN_RXF1C_F1WM_SHIFT (24U)
#define MCAN_RXF1C_F1WM_SET(x) (((uint32_t)(x) << MCAN_RXF1C_F1WM_SHIFT) & MCAN_RXF1C_F1WM_MASK)
#define MCAN_RXF1C_F1WM_GET(x) (((uint32_t)(x) & MCAN_RXF1C_F1WM_MASK) >> MCAN_RXF1C_F1WM_SHIFT)

/*
 * F1S (RW)
 *
 * Rx FIFO 1 Size
 * 0= No Rx FIFO 1
 * 1-64= Number of Rx FIFO 1 elements
 * >64= Values greater than 64 are interpreted as 64
 * The Rx FIFO 1 elements are indexed from 0 to F1S - 1
 */
#define MCAN_RXF1C_F1S_MASK (0x7F0000UL)
#define MCAN_RXF1C_F1S_SHIFT (16U)
#define MCAN_RXF1C_F1S_SET(x) (((uint32_t)(x) << MCAN_RXF1C_F1S_SHIFT) & MCAN_RXF1C_F1S_MASK)
#define MCAN_RXF1C_F1S_GET(x) (((uint32_t)(x) & MCAN_RXF1C_F1S_MASK) >> MCAN_RXF1C_F1S_SHIFT)

/*
 * F1SA (RW)
 *
 * Rx FIFO 1 Start Address
 * Start address of Rx FIFO 1 in Message RAM (32-bit word address)
 */
#define MCAN_RXF1C_F1SA_MASK (0xFFFCU)
#define MCAN_RXF1C_F1SA_SHIFT (2U)
#define MCAN_RXF1C_F1SA_SET(x) (((uint32_t)(x) << MCAN_RXF1C_F1SA_SHIFT) & MCAN_RXF1C_F1SA_MASK)
#define MCAN_RXF1C_F1SA_GET(x) (((uint32_t)(x) & MCAN_RXF1C_F1SA_MASK) >> MCAN_RXF1C_F1SA_SHIFT)

/* Bitfield definition for register: RXF1S */
/*
 * DMS (R)
 *
 * Debug Message Status
 * 00= Idle state, wait for reception of debug messages, DMA request is cleared
 * 01= Debug message A received
 * 10= Debug messages A, B received
 * 11= Debug messages A, B, C received, DMA request is set
 */
#define MCAN_RXF1S_DMS_MASK (0xC0000000UL)
#define MCAN_RXF1S_DMS_SHIFT (30U)
#define MCAN_RXF1S_DMS_GET(x) (((uint32_t)(x) & MCAN_RXF1S_DMS_MASK) >> MCAN_RXF1S_DMS_SHIFT)

/*
 * RF1L (R)
 *
 * Rx FIFO 1 Message Lost
 * This bit is a copy of interrupt flag IR.RF1L. When IR.RF1L is reset, this bit is also reset.
 * 0= No Rx FIFO 1 message lost
 * 1= Rx FIFO 1 message lost, also set after write attempt to Rx FIFO 1 of size zero
 * Note: Overwriting the oldest message when RXF1C.F1OM = ‘1’ will not set this flag.
 */
#define MCAN_RXF1S_RF1L_MASK (0x2000000UL)
#define MCAN_RXF1S_RF1L_SHIFT (25U)
#define MCAN_RXF1S_RF1L_GET(x) (((uint32_t)(x) & MCAN_RXF1S_RF1L_MASK) >> MCAN_RXF1S_RF1L_SHIFT)

/*
 * F1F (R)
 *
 * Rx FIFO 1 Full
 * 0= Rx FIFO 1 not full
 * 1= Rx FIFO 1 full
 */
#define MCAN_RXF1S_F1F_MASK (0x1000000UL)
#define MCAN_RXF1S_F1F_SHIFT (24U)
#define MCAN_RXF1S_F1F_GET(x) (((uint32_t)(x) & MCAN_RXF1S_F1F_MASK) >> MCAN_RXF1S_F1F_SHIFT)

/*
 * F1PI (R)
 *
 * Rx FIFO 1 Put Index
 * Rx FIFO 1 write index pointer, range 0 to 63.
 */
#define MCAN_RXF1S_F1PI_MASK (0x3F0000UL)
#define MCAN_RXF1S_F1PI_SHIFT (16U)
#define MCAN_RXF1S_F1PI_GET(x) (((uint32_t)(x) & MCAN_RXF1S_F1PI_MASK) >> MCAN_RXF1S_F1PI_SHIFT)

/*
 * F1GI (R)
 *
 * Rx FIFO 1 Get Index
 * Rx FIFO 1 read index pointer, range 0 to 63.
 */
#define MCAN_RXF1S_F1GI_MASK (0x3F00U)
#define MCAN_RXF1S_F1GI_SHIFT (8U)
#define MCAN_RXF1S_F1GI_GET(x) (((uint32_t)(x) & MCAN_RXF1S_F1GI_MASK) >> MCAN_RXF1S_F1GI_SHIFT)

/*
 * F1FL (R)
 *
 * Rx FIFO 1 Fill Level
 * Number of elements stored in Rx FIFO 1, range 0 to 64.
 */
#define MCAN_RXF1S_F1FL_MASK (0x7FU)
#define MCAN_RXF1S_F1FL_SHIFT (0U)
#define MCAN_RXF1S_F1FL_GET(x) (((uint32_t)(x) & MCAN_RXF1S_F1FL_MASK) >> MCAN_RXF1S_F1FL_SHIFT)

/* Bitfield definition for register: RXF1A */
/*
 * F1AI (RW)
 *
 * Rx FIFO 1 Acknowledge Index
 * After the Host has read a message or a sequence of messages from Rx FIFO 1 it has to write the buffer index of the last element read from Rx FIFO 1 to F1AI.
 * This will set the Rx FIFO 1 Get Index RXF1S.F1GI to F1AI + 1 and update the FIFO 1 Fill Level RXF1S.F1FL.
 */
#define MCAN_RXF1A_F1AI_MASK (0x3FU)
#define MCAN_RXF1A_F1AI_SHIFT (0U)
#define MCAN_RXF1A_F1AI_SET(x) (((uint32_t)(x) << MCAN_RXF1A_F1AI_SHIFT) & MCAN_RXF1A_F1AI_MASK)
#define MCAN_RXF1A_F1AI_GET(x) (((uint32_t)(x) & MCAN_RXF1A_F1AI_MASK) >> MCAN_RXF1A_F1AI_SHIFT)

/* Bitfield definition for register: RXESC */
/*
 * RBDS (RW)
 *
 * Rx Buffer Data Field Size
 * 000= 8 byte data field
 * 001= 12 byte data field
 * 010= 16 byte data field
 * 011= 20 byte data field
 * 100= 24 byte data field
 * 101= 32 byte data field
 * 110= 48 byte data field
 * 111= 64 byte data field
 */
#define MCAN_RXESC_RBDS_MASK (0x700U)
#define MCAN_RXESC_RBDS_SHIFT (8U)
#define MCAN_RXESC_RBDS_SET(x) (((uint32_t)(x) << MCAN_RXESC_RBDS_SHIFT) & MCAN_RXESC_RBDS_MASK)
#define MCAN_RXESC_RBDS_GET(x) (((uint32_t)(x) & MCAN_RXESC_RBDS_MASK) >> MCAN_RXESC_RBDS_SHIFT)

/*
 * F1DS (RW)
 *
 * Rx FIFO 1 Data Field Size
 * 000= 8 byte data field
 * 001= 12 byte data field
 * 010= 16 byte data field
 * 011= 20 byte data field
 * 100= 24 byte data field
 * 101= 32 byte data field
 * 110= 48 byte data field
 * 111= 64 byte data field
 */
#define MCAN_RXESC_F1DS_MASK (0x70U)
#define MCAN_RXESC_F1DS_SHIFT (4U)
#define MCAN_RXESC_F1DS_SET(x) (((uint32_t)(x) << MCAN_RXESC_F1DS_SHIFT) & MCAN_RXESC_F1DS_MASK)
#define MCAN_RXESC_F1DS_GET(x) (((uint32_t)(x) & MCAN_RXESC_F1DS_MASK) >> MCAN_RXESC_F1DS_SHIFT)

/*
 * F0DS (RW)
 *
 * Rx FIFO 0 Data Field Size
 * 000= 8 byte data field
 * 001= 12 byte data field
 * 010= 16 byte data field
 * 011= 20 byte data field
 * 100= 24 byte data field
 * 101= 32 byte data field
 * 110= 48 byte data field
 * 111= 64 byte data field
 * Note: In case the data field size of an accepted CAN frame exceeds the data field size configured for the matching Rx Buffer or Rx FIFO,
 * only the number of bytes as configured by RXESC are stored to the Rx Buffer resp. Rx FIFO element. The rest of the frame’s data field is ignored.
 */
#define MCAN_RXESC_F0DS_MASK (0x7U)
#define MCAN_RXESC_F0DS_SHIFT (0U)
#define MCAN_RXESC_F0DS_SET(x) (((uint32_t)(x) << MCAN_RXESC_F0DS_SHIFT) & MCAN_RXESC_F0DS_MASK)
#define MCAN_RXESC_F0DS_GET(x) (((uint32_t)(x) & MCAN_RXESC_F0DS_MASK) >> MCAN_RXESC_F0DS_SHIFT)

/* Bitfield definition for register: TXBC */
/*
 * TFQM (RW)
 *
 * Tx FIFO/Queue Mode
 * 0= Tx FIFO operation
 * 1= Tx Queue operation
 */
#define MCAN_TXBC_TFQM_MASK (0x40000000UL)
#define MCAN_TXBC_TFQM_SHIFT (30U)
#define MCAN_TXBC_TFQM_SET(x) (((uint32_t)(x) << MCAN_TXBC_TFQM_SHIFT) & MCAN_TXBC_TFQM_MASK)
#define MCAN_TXBC_TFQM_GET(x) (((uint32_t)(x) & MCAN_TXBC_TFQM_MASK) >> MCAN_TXBC_TFQM_SHIFT)

